hello = "Привет! Это бот команды приемной комиссии ФБИУКС. *Здесь Вы можете узнать ответы на все свои вопросы*☺️📎"
map = "Каширское ш., д. 31, корпус Б, кабинет 214. <b>Чтобы попасть на территорию университета нужно зарегистрироваться на проходной (слева) и предъявить паспорт. Не забудьте взять его с собой!</b>",
ask_question = "❓ Задайте интересующий вопрос. Он будет отправлен администраторам. Позже с Вами свяжутся (если у Вас скрыт аккаунт, напишите, как с Вами связаться)"
thanks_question = "❤️ Спасибо за вопрос! Скоро администраторы ответят на него"
sa = '''
<b>"Системный анализ и управление жизненным циклом сложных систем"</b>

Программа направлена на подготовку профессионалов в области проектирования, разработки и управления информационными технологиями с помощью применения уникального комплекса методик в сферах системной инженерии и теории управления. Наши выпускники составляют востребованный сегмент IT-специалистов: системные аналитики, бизнес-аналитики, форсайтеры, разработчики Big Data, архитекторы информационных систем. В процессе обучения студенты получают практические занятия на основе бизнес-симуляторов и командных игр, возможность участия в международных проектах и сотрудничества с крупными партнерами НИЯУ МИФИ.

💯 С какими баллами выдают временный студенческий билет? <b>275+</b>
<i>*Баллы без учёта индивидуальных достижений</i>

📚 Где можно посмотреть учебный план? 
На официальном сайте ФБИУКС ▶️ <a href="https://bi.mephi.ru/bakalavriat/sa">тык</a>'''
bi = '''
<b>1) "Бизнес-информатика в цифровой экономике"</b>

Данная программа характеризуется акцентом на экономическую составляющую процессов разработки и внедрения IT систем. Студентам читаются дополнительные курсы по экономике предприятия, портфельному инвестированию и прогнозирование финансовых рынков.

В процессе подготовки студенты осваивают такие сквозные цифровые технологии как анализ и интеллектуальная обработка больших данных и системы распределенного реестра (блокчейн). В учебном процессе применяются лучшие образовательные технологии: деловые игры, интеллектуальные конкурсы, тренинги, практические занятия, решение бизнес-задач, компьютерные симуляции. Выпускники программы востребованы, как специалисты в области развития информационно-аналитических методов и проектирования ИКТ систем, архитектуры предприятия и его ИТ-стратегии, инжиниринга и реинжиниринга бизнес-процессов современного предприятия.

<b>2) "Искусственный интеллект и бизнес-информатика"</b>

Программа создана для подготовки специалистов в области внедрения методов машинного обучения и технологий искусственного интеллекта в организационные и бизнес-процессы, на уровне предприятий и государственных структур. Выпускники программы способны успешно работать в сферах деятельности связанных с применением современных инструментальных средств, разработкой стратегии и тактики поведения предприятия на рынке высоких технологий, и обладающих универсальными и предметно-специализированными компетенциями, способствующими их социальной мобильности и устойчивости на рынке труда.

Наравне с базовыми курсами направления, студентам читаются курсы по теоретическим основам искусственного интеллекта, информационной безопасности и защите данных, и методам применения искусственного интеллекта в бизнес-информатике.

💯 С какими баллами выдают временный студенческий билет? <b>275+</b>
<i>*Баллы без учёта индивидуальных достижений</i>

📚 Где можно посмотреть учебный план? 
На официальном сайте ФБИУКС ▶️ <a href="https://bi.mephi.ru/bakalavriat/bi">тык</a>'''
work = '''
📜 А что можете сказать про трудоустройство?

У Вас будут перспективы карьеры в следующих компаниях и организациях:
<b>Экономика данных</b>: банки («Сбер», «Т-банк»), консалтинговые компании, финансовые структуры, а также «Яндекс», «Мейл ру», МТС
<b>Высокотехнологичные предприятия</b>: предприятия Госкорпорации «Росатом», предприятия «Роскосмос»
<b>Научные организации</b>: Институты Российской академии наук, Российские научные центры'''
dorm = '''
🏘️ Какие в МИФИ общежития?

Если Вы поступили на бюджет, общежитие Вам гарантировано. Для тех, кто будет учиться на платной основе, существует конкурс (поступающим по временному студенческому общежитие гарантировано).
В МИФИ девять общежитий: четыре квартирного типа, остальные - коридорного. 
Подробнее про общежития ▶️ <a href="https://admission.mephi.ru/about/dorm">тык</a>'''
exams = '''
😳 Есть ли возможность сдать внутренние вступительные экзамены вместо ЕГЭ?

Поступать по вступительным испытаниям имеют право:

✔ Иностранцы
✔ Люди с инвалидностью
✔ Россияне, окончившие школу за рубежом не позднее года до подачи документов и не сдававшие ЕГЭ
✔ Абитуриенты, имеющие среднее профессиональное образование (выпускники колледжей, техникумов)
✔ Абитуриенты, имеющие высшее образование (которые поступают на второе высшее).

Остальных принимаем только по результатам ЕГЭ'''
vsb = '''
📝 В чем смысл временного студенческого билета?

Если Вы олимпиадник или высокобалльник и при этом не проходите по конкурсу на бюджет, то временный студенческий гарантирует зачисление на платное обучение за счёт средств университета. Оформить билет можно, подав оригинал документа об образовании.

💯 С какими баллами выдают временный студенческий билет на ФБИУКС?

Бизнес-информатика: <b>275+</b>
Системный анализ: <b>275+</b>
<i>*Баллы без учёта индивидуальных достижений</i>'''
other = "👻 Другие вопросы есть на сайте приемной комиссии ▶️ <a href='https://clck.ru/3BqN6G'>тык</a>"
faculty = '''
🤔 В чём уникальность нашего факультета?

Студенты ФБИУКСа в дальнейшем будут работать в <b>IT-сфере</b>: системные аналитики, бизнес-аналитики, проектировщики, разработчики, архитекторы информационных систем. 
Нас интересуют IT-задачи, IT-стратегии, работа с большими данными. 

🖥️ В общем, мы ориентированы на <b>инновационную и предпринимательскую деятельность</b>: высокотехнологические startup-компании, IT-компании, цифровая экономика, страховое дело, банковское дело.'''

